[Killed] LogicalOperator
main/components/Announcements/AnnouncementsForm.js:31:18
 
 
             <Row>
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="announcementsForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {initialContents || <Col>
+                        <Form.Group className="mb-3">
+                            <Form.Label htmlFor="id">Id</Form.Label>
+                            <Form.Control data-testid="announcementsForm-id" id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+                        </Form.Group>
+                    </Col>}
 
                 <Col>
killedBy: Announcements tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
main/components/Announcements/AnnouncementsForm.js:31:18
 
 
             <Row>
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="announcementsForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {true}
 
                 <Col>
killedBy: Announcements tests renders correctly when passing in an Announcement
statusReason: Error: Unable to find an element by: [data-testid="/announcementsForm-id/"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Announcements/AnnouncementsForm.js:59:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.start && 'Start is required. '}
-                            {errors.start?.type === 'pattern' && 'Start must be provided in ISO format.'}
+                            {errors.start?.type === 'pattern' || 'Start must be provided in ISO format.'}
 
                         </Form.Control.Feedback>
killedBy: Announcements tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Start must be provided in ISO format./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Announcements/AnnouncementsForm.js:59:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.start && 'Start is required. '}
-                            {errors.start?.type === 'pattern' && 'Start must be provided in ISO format.'}
+                            {true}
 
                         </Form.Control.Feedback>
killedBy: Announcements tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Start must be provided in ISO format./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Announcements/AnnouncementsForm.js:72:42
                             id="end"
                             type="text"
                             isInvalid={Boolean(errors.end)}
-                            {...register("end", { pattern: isodate_regex})}
+                            {...register("", { pattern: isodate_regex})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: Announcements tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] OptionalChaining
main/components/Announcements/AnnouncementsForm.js:75:30
                             {...register("end", { pattern: isodate_regex})}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.end?.type === 'pattern' && 'End must be provided in ISO format.'}
+                            {errors.end.type === 'pattern' && 'End must be provided in ISO format.'}
 
                         </Form.Control.Feedback>
killedBy: Announcements tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] ConditionalExpression
main/components/Announcements/AnnouncementsForm.js:75:30
                             {...register("end", { pattern: isodate_regex})}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.end?.type === 'pattern' && 'End must be provided in ISO format.'}
+                            {true}
 
                         </Form.Control.Feedback>
killedBy: Announcements tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /End must be provided in ISO format./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/Announcements/AnnouncementsForm.js:93:58
                             as="textarea"
                             rows={3}
                             isInvalid={Boolean(errors.announcement)}
-                            {...register("announcement", {
-                                required: "Announcement is required."
-                            })}
+                            {...register("announcement", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: Announcements tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Announcement is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/Announcements/AnnouncementsForm.js:94:43
                             rows={3}
                             isInvalid={Boolean(errors.announcement)}
                             {...register("announcement", {
-                                required: "Announcement is required."
+                                required: ""
                             })}
                         />
killedBy: Announcements tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Announcement is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
