[Killed] BlockStatement
main/components/Announcements/AnnouncementsTable.js:13:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/announcements/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/announcements/edit/1"

Number of calls: 0

<html>
  <head />

[Killed] StringLiteral
main/components/Announcements/AnnouncementsTable.js:14:18
     const navigate = useNavigate();
 
     const editCallback = (cell) => {
-        navigate(`/announcements/edit/${cell.row.values.id}`)
+        navigate(``)
     }
 
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/announcements/edit/1"
Received: ""

Number of calls: 1

<html>

[Killed] StringLiteral
main/components/Announcements/AnnouncementsTable.js:36:21
             accessor: 'id',
         },
         {
-            Header: 'Start',
+            Header: "",
             accessor: 'start',
         },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Start. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: table; max-

[Killed] ObjectLiteral
main/components/Announcements/AnnouncementsTable.js:39:9
             Header: 'Start',
             accessor: 'start',
         },
-        {
-            Header: 'End',
-            accessor: 'end',
-        },
+        {},
         {
             Header: 'Announcement',
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Announcements/AnnouncementsTable.js:43:9
             Header: 'End',
             accessor: 'end',
         },
-        {
-            Header: 'Announcement',
-            accessor: 'announcement',
-        }
+        {}
     ];
 
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Announcements/AnnouncementsTable.js:44:21
             accessor: 'end',
         },
         {
-            Header: 'Announcement',
+            Header: "",
             accessor: 'announcement',
         }
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Announcement. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: tabl

[Killed] StringLiteral
main/components/Announcements/AnnouncementsTable.js:50:35
     ];
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "announcementsTable"));
+        columns.push(ButtonColumn("", "primary", editCallback, "announcementsTable"));
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "announcementsTable"));
     }
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Announcements/AnnouncementsTable.js:50:68
     ];
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "announcementsTable"));
+        columns.push(ButtonColumn("Edit", "primary", editCallback, ""));
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "announcementsTable"));
     }
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="announcementsTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
      style="background: white; display: table; max-width: -moz-fit-content; margin: 0px auto; overflow-x: auto; white-space: nowrap;"

[Killed] StringLiteral
main/components/Announcements/AnnouncementsTable.js:51:45
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
         columns.push(ButtonColumn("Edit", "primary", editCallback, "announcementsTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "announcementsTable"));
+        columns.push(ButtonColumn("Delete", "", deleteCallback, "announcementsTable"));
     }
 
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Error: expect(element).toHaveClass("btn-danger")

Expected the element to have class:
  btn-danger
Received:
  btn

[Killed] StringLiteral
main/components/Announcements/AnnouncementsTable.js:51:35
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
         columns.push(ButtonColumn("Edit", "primary", editCallback, "announcementsTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "announcementsTable"));
+        columns.push(ButtonColumn("", "danger", deleteCallback, "announcementsTable"));
     }
 
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: Error: A column ID (or string accessor) is required!
