[Survived] BlockStatement
src/main/pages/AnnouncementsIndexPage.js:14:30
 
   const currentUser = useCurrentUser();
 
-  const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-        return (
-            <Button
-                variant="primary"
-                href="/announcements/create"
-                style={{ float: "right" }}
-            >
-                Create Announcement
-            </Button>
-        )
-    }
-  }
+  const createButton = () => {}
 
   const { data: announcements, error: _error, status: _status } =

[Survived] BlockStatement
src/main/pages/AnnouncementsIndexPage.js:15:45
   const currentUser = useCurrentUser();
 
   const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-        return (
-            <Button
-                variant="primary"
-                href="/announcements/create"
-                style={{ float: "right" }}
-            >
-                Create Announcement
-            </Button>
-        )
-    }
+    if (hasRole(currentUser, "ROLE_ADMIN")) {}
   }
 

[Survived] StringLiteral
src/main/pages/AnnouncementsIndexPage.js:32:29
     useBackend(
       // Stryker disable next-line all : don't test internal caching of React Query
       ["/api/announcements/all"],
-      { method: "GET", url: "/api/announcements/all" },
+      { method: "GET", url: "" },
       // Stryker disable next-line all : don't test default value of empty list
       []
