[Killed] ArrayDeclaration
main/components/Commons/CommonsTable.js:109:28
 
     const testid = "CommonsTable";
 
-    const columnsIfAdmin = [
-        ...columns,
-        ButtonColumn("Edit", "primary", editCallback, testid),
-        ButtonColumn("Delete", "danger", deleteCallback, testid),
-        ButtonColumn("Leaderboard", "secondary", leaderboardCallback, testid),
-        HrefButtonColumn("Stats CSV", "success", `/api/commonstats/download?commonsId=`, testid),
-        HrefButtonColumn("Announcements", "secondary", `/admin/announcements/`, testid)
-    ];
+    const columnsIfAdmin = [];
 
     const columnsToDisplay = hasRole(currentUser,"ROLE_ADMIN") ? columnsIfAdmin : columns;
killedBy: AdminListCommonPage tests renders three commons without crashing for admin user
statusReason: Error: Unable to find an element by: [data-testid="CommonsTable-cell-row-0-col-commons.id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Survived] StringLiteral
main/components/Commons/CommonsTable.js:115:56
         ButtonColumn("Delete", "danger", deleteCallback, testid),
         ButtonColumn("Leaderboard", "secondary", leaderboardCallback, testid),
         HrefButtonColumn("Stats CSV", "success", `/api/commonstats/download?commonsId=`, testid),
-        HrefButtonColumn("Announcements", "secondary", `/admin/announcements/`, testid)
+        HrefButtonColumn("Announcements", "secondary", ``, testid)
     ];
 
