[Survived] BooleanLiteral
src/main/pages/AnnouncementsCreatePage.js:7:60
 import { useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify"
 
-export default function AnnouncementsCreatePage({storybook=false}) {
+export default function AnnouncementsCreatePage({storybook=true}) {
 
   const objectToAxiosParams = (announcement) => ({

[Survived] ArrowFunction
src/main/pages/AnnouncementsCreatePage.js:9:31
 
 export default function AnnouncementsCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (announcement) => ({
-    url: "/api/announcements/post",
-    method: "POST",
-    params: {
-      id: announcement.id,
-      commonsId: announcement.commonsId,
-      start: announcement.start,
-      end: announcement.end,
-      announcement: announcement.announcement
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (announcement) => {

[Survived] ObjectLiteral
src/main/pages/AnnouncementsCreatePage.js:9:50
 
 export default function AnnouncementsCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (announcement) => ({
-    url: "/api/announcements/post",
-    method: "POST",
-    params: {
-      id: announcement.id,
-      commonsId: announcement.commonsId,
-      start: announcement.start,
-      end: announcement.end,
-      announcement: announcement.announcement
-    }
-  });
+  const objectToAxiosParams = (announcement) => ({});
 
   const onSuccess = (announcement) => {

[Survived] StringLiteral
src/main/pages/AnnouncementsCreatePage.js:10:10
 export default function AnnouncementsCreatePage({storybook=false}) {
 
   const objectToAxiosParams = (announcement) => ({
-    url: "/api/announcements/post",
+    url: "",
     method: "POST",
     params: {

[Survived] BlockStatement
src/main/pages/AnnouncementsCreatePage.js:21:39
     }
   });
 
-  const onSuccess = (announcement) => {
-    toast(`New Announcement Created - id: ${announcement.id}, commonsId: ${announcement.commonsId}`);
-  }
+  const onSuccess = (announcement) => {}
 
   const mutation = useBackendMutation(

[Survived] StringLiteral
src/main/pages/AnnouncementsCreatePage.js:22:11
   });
 
   const onSuccess = (announcement) => {
-    toast(`New Announcement Created - id: ${announcement.id}, commonsId: ${announcement.commonsId}`);
+    toast(``);
   }
 

[Survived] BlockStatement
src/main/pages/AnnouncementsCreatePage.js:38:32
     mutation.mutate(data);
   }
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/announcements" />
-  }
+  if (isSuccess && !storybook) {}
 
 
