[Survived] BlockStatement
src/main/pages/AnnouncementsIndexPage.js:16:30
   //const commonsId = ;
   //const commonsName =;
 
-  const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-        return (
-            <Button
-                variant="primary"
-                href="/admin/announcements/:commonsId/create"
-                style={{ float: "right" }}
-            >
-                Create Announcement
-            </Button>
-        )
-    }
-  }
+  const createButton = () => {}
 
   const { data: announcements, error: _error, status: _status } =

[Survived] StringLiteral
src/main/pages/AnnouncementsIndexPage.js:34:17
     useBackend(
       // Stryker disable next-line all : don't test internal caching of React Query
       [`api/announcements/:commonsId/all`],
-      { method: "GET", url: `/api/announcements/:commonsId/all` },
+      { method: "", url: `/api/announcements/:commonsId/all` },
       // Stryker disable next-line all : don't test default value of empty list
       []

[Survived] StringLiteral
src/main/pages/AnnouncementsIndexPage.js:34:29
     useBackend(
       // Stryker disable next-line all : don't test internal caching of React Query
       [`api/announcements/:commonsId/all`],
-      { method: "GET", url: `/api/announcements/:commonsId/all` },
+      { method: "GET", url: `` },
       // Stryker disable next-line all : don't test default value of empty list
       []
