[Killed] StringLiteral
main/components/Commons/CommonsTable.js:56:17
         {
             Header: <span>Cow< br /> Price</span>,
             accessor: row => row.commons.cowPrice,
-            id: 'commons.cowPrice'
+            id: ""
         },
         {
killedBy: UserTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:61:17
         {
             Header:<span> Milk <br /> Price </span>,
             accessor: row => row.commons.milkPrice,
-            id: 'commons.milkPrice'
+            id: ""
         },
         {
killedBy: AdminListCommonPage tests renders without crashing for regular user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:71:17
         {
             Header:<span> Starting <br /> Date </span>,
             accessor: row => String(row.commons.startingDate).slice(0,10),
-            id: 'commons.startingDate'
+            id: ""
         },
         {
killedBy: AdminListCommonPage tests renders without crashing for regular user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Commons/CommonsTable.js:73:9
             accessor: row => String(row.commons.startingDate).slice(0,10),
             id: 'commons.startingDate'
         },
-        {
-            Header:<span> Last <br /> Date </span>,
-            accessor: row => String(row.commons.lastDate).slice(0,10),
-            id: 'commons.lastDate'
-        },
+        {},
         {
             Header: <span> Degrad <br /> Rate </span>,
killedBy: AdminListCommonPage tests renders without crashing for regular user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Commons/CommonsTable.js:76:17
         {
             Header:<span> Last <br /> Date </span>,
             accessor: row => String(row.commons.lastDate).slice(0,10),
-            id: 'commons.lastDate'
+            id: ""
         },
         {
killedBy: AdminListCommonPage tests renders without crashing for regular user
statusReason: Error: A column ID (or string accessor) is required!

[Survived] StringLiteral
main/components/Commons/CommonsTable.js:116:43
         ButtonColumn("Delete", "danger", deleteCallback, testid),
         ButtonColumn("Leaderboard", "secondary", leaderboardCallback, testid),
         HrefButtonColumn("Stats CSV", "success", `/api/commonstats/download?commonsId=`, testid),
-        HrefButtonColumn("Announcements", "secondary", `/admin/announcements/`, testid)
+        HrefButtonColumn("Announcements", "", `/admin/announcements/`, testid)
     ];
 
